tap "adembc/tap", "https://github.com/Adembc/homebrew-tap", trusted: true
tap "anomalyco/tap", trusted: true
tap "derailed/k9s", trusted: true
tap "dotenvx/brew", trusted: true
tap "felixkratz/formulae", trusted: true
tap "go-task/tap", trusted: true
tap "mhaeuser/mhaeuser", trusted: true
tap "nikitabobko/tap", trusted: true
tap "siderolabs/tap", trusted: true
tap "warrensbox/tap", trusted: true
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Multi-shell multi-command argument completer
brew "carapace"
# CLI to perform various actions on CIDR ranges
brew "cidr"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# CLI tool to nuke (delete) cloud resources
brew "cloud-nuke"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# See where your AI coding tokens go - by task, tool, model, and project
brew "codeburn"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Modern, maintained replacement for ls
brew "eza"
# Test various flash cards
brew "f3"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Open-source GitLab command-line tool
brew "glab"
# Fast linters runner for Go
brew "golangci-lint"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Client library for huggingface.co hub
brew "hf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# LLM inference in C/C++
brew "llama.cpp"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: true
# Terminal-based visual file manager
brew "midnight-commander"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Modern replacement for ps written in Rust
brew "procs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Safe, concurrent, practical language
brew "rust"
# Prettier way to inspect network connections
brew "snitch"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for managing SSH connections.  
brew "adembc/tap/lazyssh"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch", link: false
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Chromium based browser
cask "arc"
# Graphical configurator for Dygma Raise keyboards
cask "bazecor"
# Web browser focusing on privacy
cask "brave-browser"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Open-source keystroke visualiser
cask "keycastr"
# Discover, download, and run local LLMs
cask "lm-studio"
# Adaptive brightness for external displays
cask "lunar"
# Extensible two-pane file manager
cask "marta"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Whisper dictation/transcription app
cask "opensuperwhisper"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# The tfswitch command lets you switch between terraform versions.
cask "warrensbox/tap/tfswitch"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Keynote", id: 361285480
mas "Mudra Link", id: 6593681411
mas "Numbers", id: 409203825
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
uv "specify-cli", source: "git+https://github.com/github/spec-kit.git"
npm "@earendil-works/pi-coding-agent"
